Repository: Sa3doola/ITRootsTask
Catalog: ITRootsTask/Infrastructure/Validation/*.lproj/ValidationLocalized.strings
Languages: ar

source: Please enter your phone number.
ar: يرجى إدخال رقم الجوال الخاص بك.

source: Please enter correct phone number.
ar: الرجاء إدخال رقم جوال صحيح.

source: countryCodeMissed
ar: الرجاء اختيار كود الدولة

source: Please enter verification code
ar: الرجاء إدخال رمز التحقق

source: Verification Code should be 4 digits.
ar: يجب أن يتكون رمز التحقق من 4 أرقام.

source: Please enter name.
ar: الرجاء إدخال الاسم.

source: Name is too short.
ar: الإسم قصير جدا.

source: Name is too long.
ar: الاسم طويل جدا.

source: Please pick your profile picture.
ar: يرجى اختيار صورة ملفك الشخصي.

source: Please Enter Nick Name
ar: من فضلك ادخل الاسم المستعار

source: Please Enter Feed Name
ar: من فضلك ادخل اسم العلف

source: Please Enter Current Quantity
ar: من فضلك ادخل الكمية الحالية

source: Please Select Quantity Name
ar: من فضلك اختار اسم الكمية

source: Please Select Animal Taken Feed
ar: من فضلك اختار الحيوان المتلقي للعلف

source: Please Select Expire Date
ar: من فضلك اختار تاريخ الصلاحية

source: Please Enter Total Price
ar: من فضلك ادخل السعر الكلي

source: Please Attach Invoice Image
ar: قم بارفاق صورة الفاتورة

source: Please Attach Feed Image
ar: قم بارفاق صورة العلف

source: Please enter first name.
ar: الرجاء إدخال الاسم الأول.

source: First name is too short.
ar: الاسم الأول قصير جدًا.

source: First name is too long.
ar: الاسم الأول طويل جدًا.

source: Please enter last name.
ar: الرجاء إدخال الاسم الأخير.

source: Last name is too short.
ar: الاسم الأخير قصير جدًا.

source: Last name is too long.
ar: الاسم الأخير طويل جدًا.

source: Please enter family name.
ar: الرجاء إدخال اسم العائلة.

source: Family name is too short.
ar: اسم العائلة قصير جدا.

source: Family name is too long.
ar: اسم العائلة طويل جدًا.

source: Please enter full name.
ar: الرجاء إدخال الاسم الكامل.

source: Full name is too short.
ar: الاسم الكامل قصير جدا.

source: Full name is too long.
ar: الاسم الكامل طويل جدًا.

source: Please enter store arabic name.
ar: الرجاء إدخال اسم المتجر بالعربية.

source: Store arabic name is too short.
ar: اسم المتجر بالعربية قصير جدًا.

source: Store arabic name is too long.
ar: الاسم بالعربية طويل جدًا للمتجر.

source: Please enter store english name.
ar: الرجاء إدخال اسم المتجر بالانجليزية.

source: Store english name is too short.
ar: اسم المتجر بالانجليزية قصير جدًا.

source: Store english name is too long.
ar: الاسم بالانجليزية طويل جدًا للمتجر.

source: Please enter Notes
ar: من فضلك ادخل ملاحظات الطلب

source: Please Select Payment
ar: من فضلك اختار طريقة الدفع

source: Please enter correct whatsApp number.
ar: الرجاء إدخال رقم واتساب صحيح.

source: Please enter email field.
ar: الرجاء إدخال حقل البريد الإلكتروني.

source: Please enter correct email address.
ar: رجاء، أدخل عنوان البريد الإلكتروني صحيح.

source: Please enter password field.
ar: الرجاء إدخال حقل كلمة المرور.

source: Password is too short, it should be 6 characters at least.
ar: كلمة المرور قصيرة جدًا ، يجب أن تتكون من 6 أحرف على الأقل.

source: Please enter new password field.
ar: الرجاء إدخال حقل كلمة المرور الجديدة.

source: New password is too short, it should be 6 characters at least.
ar: كلمة المرور الجديدة قصيرة جدًا ، يجب أن تتكون من 6 أحرف على الأقل.

source: Please enter old password field.
ar: الرجاء إدخال حقل كلمة المرور القديمة.

source: Old password is too short, it should be 6 characters at least.
ar: كلمة المرور القديمة قصيرة جدًا ، يجب أن تتكون من 6 أحرف على الأقل.

source: Please enter confirm new password field.
ar: الرجاء إدخال حقل تأكيد كلمة المرور الجديدة.

source: Please enter confirm password field.
ar: الرجاء إدخال حقل تأكيد كلمة المرور.

source: Passwords not match.
ar: كلمات المرور غير متطابقة.

source: Please read and agree our terms and conditions first
ar: يرجى قراءة البنود والشروط الخاصة بنا والموافقة عليها أولاً

source: Please select country.
ar: الرجاء تحديد الدولة.

source: Please select governorate
ar: الرجاء تحديد المحافظة

source: Please select city.
ar: الرجاء تحديد المدينة.

source: Please select the floor
ar: الرجاء تحديد الطابق

source: Please select area.
ar: الرجاء تحديد المنطقة.

source: Please enter street name.
ar: الرجاء إدخال اسم الشارع.

source: Please enter address type.
ar: الرجاء إدخال نوع العنوان.

source: Please select the location.
ar: الرجاء تحديد الموقع.

source: Please write address details
ar: الرجاء كتابة تفاصيل العنوان

source: Please selecte village
ar: يرجى تحديد القرية

source: Please selecte district
ar: يرجى تحديد الحي

source: please enter iban Number
ar: من فصلك ادخل رقم الايبان

source: Please pick cover picture.
ar: الرجاء اختيار صورة الغلاف.

source: Please pick license picture.
ar: الرجاء اختيار صورة الترخيص.

source: Please pick product image.
ar: الرجاء اختيار صورة المنتج.

source: Please pick car picture
ar: الرجاء اختيار صورة السيارة

source: Please enter car palet.
ar: الرجاء إدخال رقم لوحة السيارة.

source: Please select car model.
ar: الرجاء تحديد طراز السيارة.

source: Please Select car type.
ar: الرجاء تحديد نوع السيارة.

source: Please enter the age.
ar: الرجاء إدخال العمر.

source: If it is your age, please grow up first =D.
ar: إذا كان هذا هو عمرك ، فالرجاء أن تكبر أولاً.

source: Please select older date.
ar: يرجى تحديد تاريخ أقدم.

source: Please select newer date.
ar: الرجاء تحديد تاريخ أحدث.

source: Please select the date.
ar: الرجاء تحديد التاريخ.

source: Please Enter Time
ar: الرجاء تحديد الوقت

source: You Must Send Subject Title
ar: يجب عليك إرسال عنوان الموضوع

source: Please enter your message
ar: أدرج رسالتك من فضلك

source: Please enter title type
ar: الرجاء إدخال نوع العنوان

source: Please Enter Message Title
ar: برجاء ادخال عنوان الرسالة

source: Please select Contact Us Type
ar: برجاء اختيار نوع التوصيل

source: please enter Order Details
ar: من فضلك ادخل تفاصيل الطلب

source: Please enter bank account holder name
ar: الرجاء إدخال اسم صاحب الحساب المصرفي

source: Please enter bank name
ar: الرجاء إدخال اسم البنك

source: Please select bank transfer image
ar: الرجاء تحديد صورة التحويل المصرفي

source: Please enter from bank name
ar: الرجاء إدخال من اسم البنك

source: Please enter bank account number
ar: الرجاء إدخال رقم الحساب المصرفي

source: Please enter your price
ar: الرجاء ادخال المبلغ

source: Please Select category
ar: الرجاء تحديد القسم

source: Please enter price before
ar: الرجاء إدخال السعر قبل

source: Please enter price after
ar: الرجاء إدخال السعر بعد

source: price before is smaller than price after
ar: السعر قبل أقل من السعر بعد

source: Please enter description
ar: الرجاء إدخال الوصف

source: Please select the topic
ar: الرجاء اختيار الموضوع

source: Please select the inquiry
ar: الرجاء اختيار نوع الإستعلام

source: please select duration
ar: من فضلك ادخل المدة المطلوبة

source: Please enter the number of participants
ar: من فضلك ادخل عدد المشاركين

source: invalid message type
ar: نوع الرسالة خاطئ

source: Please select a message type
ar: من فضلك قم باختيار نوع الرسالة
